; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l27_p27_c27_g27_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(person-at person1 loc9)
	(person-at person2 loc2)
	(person-at person3 loc3)
	(person-at person4 loc24)
	(person-at person5 loc15)
	(person-at person6 loc22)
	(person-at person7 loc4)
	(person-at person8 loc8)
	(person-at person9 loc10)
	(person-at person10 loc11)
	(person-at person11 loc14)
	(person-at person12 loc25)
	(person-at person13 loc4)
	(person-at person14 loc22)
	(person-at person15 loc21)
	(person-at person16 loc18)
	(person-at person17 loc2)
	(person-at person18 loc19)
	(person-at person19 loc18)
	(person-at person20 loc3)
	(person-at person21 loc5)
	(person-at person22 loc11)
	(person-at person23 loc16)
	(person-at person24 loc15)
	(person-at person25 loc26)
	(person-at person26 loc6)
	(person-at person27 loc17)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person12 food)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person14 medicine)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person16 medicine)
	(has-content-person person18 food)
	(has-content-person person21 medicine)
	(has-content-person person22 food)
	(has-content-person person22 medicine)
	(has-content-person person25 medicine)
	(has-content-person person26 food)
	(has-content-person person27 medicine)
))
)

; plan
1. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate27 depot)
   added: (has-crate-drone-arm drone1 right crate27)
   goals met: 1 of 28
2. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 1 of 28
3. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 0 of 28
4. (drop-crate loc26 person25 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate27)
   added: (has-content-person person25 medicine) (empty-arm drone1 right)
   goals met: 1 of 28
5. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 2 of 28
6. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate26 depot)
   added: (has-crate-drone-arm drone1 right crate26)
   goals met: 2 of 28
7. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 1 of 28
8. (drop-crate loc25 person12 crate11 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person12 food) (empty-arm drone1 left)
   goals met: 2 of 28
9. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 3 of 28
10. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 3 of 28
11. (drone-move depot loc24 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc24)
   goals met: 2 of 28
12. (drop-crate loc24 person4 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate26)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 3 of 28
13. (drone-move loc24 depot drone1)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 depot)
   goals met: 4 of 28
14. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate25 depot)
   added: (has-crate-drone-arm drone1 right crate25)
   goals met: 4 of 28
15. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 3 of 28
16. (drop-crate loc19 person18 crate10 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person18 food) (empty-arm drone1 left)
   goals met: 4 of 28
17. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 5 of 28
18. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 5 of 28
19. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 4 of 28
20. (drop-crate loc17 person27 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate25)
   added: (has-content-person person27 medicine) (empty-arm drone1 right)
   goals met: 5 of 28
21. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 6 of 28
22. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate24 depot)
   added: (has-crate-drone-arm drone1 right crate24)
   goals met: 6 of 28
23. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 5 of 28
24. (drop-crate loc10 person9 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate24)
   added: (has-content-person person9 medicine) (empty-arm drone1 right)
   goals met: 6 of 28
25. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 7 of 28
26. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate23 depot)
   added: (has-crate-drone-arm drone1 right crate23)
   goals met: 7 of 28
27. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 6 of 28
28. (drop-crate loc6 person26 crate9 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person26 food) (empty-arm drone1 left)
   goals met: 7 of 28
29. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 8 of 28
30. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 8 of 28
31. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 7 of 28
32. (drop-crate loc5 person21 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate23)
   added: (has-content-person person21 medicine) (empty-arm drone1 right)
   goals met: 8 of 28
33. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 9 of 28
34. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate22 depot)
   added: (has-crate-drone-arm drone1 right crate22)
   goals met: 9 of 28
35. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 8 of 28
36. (drop-crate loc3 person3 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 9 of 28
37. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 10 of 28
38. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 10 of 28
39. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 9 of 28
40. (drop-crate loc2 person2 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate22)
   added: (has-content-person person2 medicine) (empty-arm drone1 right)
   goals met: 10 of 28
41. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 11 of 28
42. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate21 depot)
   added: (has-crate-drone-arm drone1 right crate21)
   goals met: 11 of 28
43. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 10 of 28
44. (drop-crate loc22 person14 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person14 food) (empty-arm drone1 left)
   goals met: 11 of 28
45. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 12 of 28
46. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 12 of 28
47. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 11 of 28
48. (drop-crate loc22 person6 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate21)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 12 of 28
49. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 13 of 28
50. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate20 depot)
   added: (has-crate-drone-arm drone1 right crate20)
   goals met: 13 of 28
51. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 12 of 28
52. (drop-crate loc22 person14 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate20)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 13 of 28
53. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 14 of 28
54. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate19 depot)
   added: (has-crate-drone-arm drone1 right crate19)
   goals met: 14 of 28
55. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 13 of 28
56. (drop-crate loc21 person15 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person15 food) (empty-arm drone1 left)
   goals met: 14 of 28
57. (drop-crate loc21 person15 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate19)
   added: (has-content-person person15 medicine) (empty-arm drone1 right)
   goals met: 15 of 28
58. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 16 of 28
59. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate18 depot)
   added: (has-crate-drone-arm drone1 right crate18)
   goals met: 16 of 28
60. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 16 of 28
61. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 15 of 28
62. (drop-crate loc18 person16 crate5 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person16 food) (empty-arm drone1 left)
   goals met: 16 of 28
63. (drop-crate loc18 person16 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate18)
   added: (has-content-person person16 medicine) (empty-arm drone1 right)
   goals met: 17 of 28
64. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 18 of 28
65. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate17 depot)
   added: (has-crate-drone-arm drone1 right crate17)
   goals met: 18 of 28
66. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 18 of 28
67. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 17 of 28
68. (drop-crate loc15 person5 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person5 food) (empty-arm drone1 left)
   goals met: 18 of 28
69. (drop-crate loc15 person5 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate17)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 19 of 28
70. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 20 of 28
71. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate16 depot)
   added: (has-crate-drone-arm drone1 right crate16)
   goals met: 20 of 28
72. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 20 of 28
73. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 19 of 28
74. (drop-crate loc11 person22 crate3 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person22 food) (empty-arm drone1 left)
   goals met: 20 of 28
75. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 21 of 28
76. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 21 of 28
77. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 20 of 28
78. (drop-crate loc11 person10 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate16)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 21 of 28
79. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 22 of 28
80. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 22 of 28
81. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 21 of 28
82. (drop-crate loc11 person22 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person22 medicine) (empty-arm drone1 right)
   goals met: 22 of 28
83. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 23 of 28
84. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 right crate14)
   goals met: 23 of 28
85. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 22 of 28
86. (drop-crate loc8 person8 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person8 food) (empty-arm drone1 left)
   goals met: 23 of 28
87. (drop-crate loc8 person8 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate14)
   added: (has-content-person person8 medicine) (empty-arm drone1 right)
   goals met: 24 of 28
88. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 25 of 28
89. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 right crate13)
   goals met: 25 of 28
90. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 25 of 28
91. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 24 of 28
92. (drop-crate loc4 person7 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person7 food) (empty-arm drone1 left)
   goals met: 25 of 28
93. (drop-crate loc4 person7 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate13)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 26 of 28
94. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 27 of 28
95. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 27 of 28
96. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 26 of 28
97. (drop-crate loc4 person13 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person13 medicine) (empty-arm drone1 right)
   goals met: 27 of 28
98. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 28 of 28
